---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateTaperedWallForWallTypeError
source: html/835fbd8a-c16d-11dc-74ce-81ea37b2e3cf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateTaperedWallForWallTypeError Property

Cannot create tapered wall - the Wall Type is unacceptable. Be sure to choose a variable-thickness layer in the Wall Type.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateTaperedWallForWallTypeError { get; }
```